espressif/esp-idf/components/esp_hal_i3c/esp32p4/include/hal/i3c_master_ll.h
/*
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

// The LL layer for I3C register operations

#pragma once

#include <stdbool.h>
#include "hal/misc.h"
#include "hal/assert.h"
#include "soc/soc_caps.h"
#include "soc/clk_tree_defs.h"
#include "soc/hp_sys_clkrst_struct.h"
#include "hal/misc.h"
#include "soc/i3c_mst_mem_struct.h"
#include "soc/i3c_mst_struct.h"
#include "soc/i3c_mst_reg.h"
#include "hal/i3c_master_types.h"
#include "soc/io_mux_struct.h"
#include "esp_bit_defs.h"

#ifdef __cplusplus
extern "C" {
#endif

#define I3C_LL_GET_HW(num)          (((num) == 0) ? (&I3C_MST) : NULL)
#define I3C_LL_MASTER_EVENT_INTR    (I3C_MST_TRANSFER_COMPLETE_INT_ENA_M | I3C_MST_COMMAND_DONE_INT_ENA_M | I3C_MST_TX_DATA_BUF_THLD_INT_ENA_M | I3C_MST_RX_DATA_BUF_THLD_INT_ENA_M)
#define I3C_LL_MASTER_DATA_BUFFER_SIZE       (128) // The TX Data Buffer and the RX Data Buffer can store up to 128 bytes at a time
#define I3C_LL_MASTER_COMMON_INTR      (I3C_MST_TRANSFER_COMPLETE_INT_ENA_M | I3C_MST_COMMAND_DONE_INT_ENA_M | I3C_MST_IBI_HANDLE_DONE_INT_ENA_M)
#define I3C_LL_MASTER_TRANSMIT_INTR    (I3C_MST_TX_DATA_BUF_THLD_INT_ENA_M)
#define I3C_LL_MASTER_RECEIVE_INTR     (I3C_MST_RX_DATA_BUF_THLD_INT_ENA_M)
#define I3C_LL_MASTER_INTERNAL_PULLUP_IO_PINS_MASK            (BIT64(32) | BIT64(33))
#define I3C_MASTER_LL_PERIPH_NUM                   (1)
#define I3C_MASTER_LL_ADDRESS_TABLE_NUM            (12)
#define I3C_MASTER_LL_COMMAND_TABLE_NUM            (12)

#define I3C_MASTER_LL_DEFAULT_SETUP_TIME     (600)

/**
 * @brief I3C master command types
 *
 * This enumeration defines the types of commands that the I3C master can issue.
 * Each command type corresponds to a specific purpose in the I3C communication protocol.
 */
typedef enum {
    I3C_MASTER_LL_COMMAND_REGULAR = 0,             ///< I3C master sends regular command
    I3C_MASTER_LL_COMMAND_IMMEDIATE = 1,           ///< I3C master sends immediate command
    I3C_MASTER_LL_COMMAND_ADDRESS_ASSIGNMENT = 2,  ///< I3C master assigns address command
} i3c_master_ll_command_type_t;

/**
 * @brief I3C master transfer directions
 *
 * This enumeration defines the direction of data transfer for I3C master operations.
 * The transfer direction specifies whether the master sends data to or receives data from the target device.
 */
typedef enum {
    I3C_MASTER_LL_TRANSFER_DIR_WRITE = 0, ///< I3C master write direction
    I3C_MASTER_LL_TRANSFER_DIR_READ = 1,  ///< I3C master read direction
} i3c_master_ll_transfer_direction_t;

/**
 * @brief I3C Master Command Descriptor
 *
 * This structure represents a command entry for the I3C master. It is used
 * to define and execute different types of I3C commands, including address
 * assignment, immediate commands, and regular transfers. Each entry consists
 * of two parts: the low part (`cmd_l`) and the high part (`cmd_h`).
 */
typedef struct {
    /**
     * @brief Command Low Part (cmd_l)
     *
     * This union defines the command attributes for different types of I3C commands.
     */
    union {
        /**
         * @brief Address Assignment Command
         *
         * Used for dynamically assigning addresses to devices on the I3C bus.
         */
        struct {
            uint32_t cmd_attr   : 3; ///< Command type (0: regular, 1: immediate, 2: address assignment). See `i3c_master_ll_command_type_t`.
            uint32_t tid        : 4; ///< Transaction ID, used as an identification tag for this command. The same value shall be reflected in the Response Descriptor.
            uint32_t cmd        : 8; ///< Transfer Command CCC value, specifies CCC code.
            uint32_t reserved15 : 1; ///< Reserved bit.
            uint32_t dev_indx   : 5; ///< Indicates the DAT table index for the slave device being addressed with the transfer. Static and Device addressing related information will be stored to this index in the DAT. This field is reserved in Broadcast CCC transfer.
            uint32_t reserved21 : 5; ///< Reserved bits.
            uint32_t dev_cnt    : 4; ///< Indicates the number of devices to which Dynamic Address shall be assigned.
            uint32_t roc        : 1; ///< Response on Completion, controls whether the response status is sent after the successful completion of the transfer command. (0: Respond status is not required, 1: Respond status is required).
            uint32_t toc        : 1; ///< Terminate on Completion, controls what bus condition to issue after the transfer command completes. (0: Issue repeated start (Sr) at the end of transfer. 1: Issue Stop (P) at the end of transfer Note: This field must be set to 1 for ENTDAA. It is meaningful for SETDASA transfer)
        } addr; ///< Address assignment command format.

        /**
         * @brief Immediate Command
         *
         *  It is suitable for situations where a small amount of data needs to be transferred quickly,
         *  and the data is directly included in the command.
         */
        struct {
            uint32_t cmd_attr   : 3; ///< Command type (0: regular, 1: immediate, 2: address assignment). See `i3c_master_ll_command_type_t`.
            uint32_t tid        : 4; ///< Transaction ID, used as an identification tag for this command. The same value shall be reflected in the Response Descriptor.
            uint32_t cmd        : 8; ///< Transfer Command CCC value, specifies CCC code.
            uint32_t cp         : 1; ///< Command Present, indicates whether the CMD field is valid for CCC transfer
            uint32_t dev_indx   : 5; ///< Indicates the DAT table index for the slave device being addressed with the transfer. Static and Device addressing related information will be stored to this index in the DAT. This field is reserved in Broadcast CCC transfer.
            uint32_t reserved21 : 2; ///< Reserved bits.
            uint32_t bc         : 3; ///< Byte count (number of bytes transferred in command_h).
            uint32_t mode       : 3; ///< Data Transfer Speed and Mode. Set the mode and speed for the I3C or I2C transfer. Interpretation of this field depends on whether the Device is in I3C Mode vs. I2C Mode (see the DEVICE field in the DAT Table entry indexed by field DEV_INDEX).
            uint32_t rnw        : 1; ///< Identifies the direction of this transfer (1: read, 0: write). See `i3c_master_ll_transfer_direction_t`.
            uint32_t roc        : 1; ///< Response on Completion, controls whether the response status is sent after the successful completion of the transfer command. (0: Respond status is not required, 1: Respond status is required).
            uint32_t toc        : 1; ///< Terminate on Completion, controls what bus condition to issue after the transfer command completes. (0: Issue repeated start at the end of transfer. 1: Issue Stop (P) at the end of transfer Note: This field must be set to 1 for ENTDAA. It is meaningful for SETDASA transfer)
        } immediate; ///< Immediate command format.

        /**
         * @brief Regular Transfer Command
         *
         * Used for general CCC transfer and private data transfer
         */
        struct {
            uint32_t cmd_attr   : 3; ///< Command type (0: regular, 1: immediate, 2: address assignment). See `i3c_master_ll_command_type_t`.
            uint32_t tid        : 4; ///< Transaction ID, used as an identification tag for this command. The same value shall be reflected in the Response Descriptor.
            uint32_t cmd        : 8; ///< Transfer Command CCC value, specifies CCC code.
            uint32_t cp         : 1; ///< Command Present, indicates whether the CMD field is valid for CCC transfer
            uint32_t dev_indx   : 5; ///< Indicates the DAT table index for the slave device being addressed with the transfer. Static and Device addressing related information will be stored to this index in the DAT. This field is reserved in Broadcast CCC transfer.
            uint32_t reserved21 : 5; ///< Reserved bits.
            uint32_t mode       : 3; ///< Data Transfer Speed and Mode. Set the mode and speed for the I3C or I2C transfer. Interpretation of this field depends on whether the Device is in I3C Mode vs. I2C Mode (see the DEVICE field in the DAT Table entry indexed by field DEV_INDEX).
            uint32_t rnw        : 1; ///< Identifies the direction of this transfer (1: read, 0: write). See `i3c_master_ll_transfer_direction_t`.
            uint32_t roc        : 1; ///< Response on Completion, controls whether the response status is sent after the successful completion of the transfer command. (0: Respond status is not required, 1: Respond status is required).
            uint32_t toc        : 1; ///< Terminate on Completion, controls what bus condition to issue after the transfer command completes. (0: Issue repeated start at the end of transfer. 1: Issue Stop (P) at the end of transfer Note: This field must be set to 1 for ENTDAA. It is meaningful for SETDASA transfer)
        } regular; ///< Regular transfer command format.

        /**
         * @brief Raw Value Access
         *
         * Provides direct access to the 32-bit value of the command.
         */
        uint32_t val; ///< Raw 32-bit value of the command.
    } cmd_l; ///< Low part of the command.

    /**
     * @brief Command High Part (cmd_h)
     *
     * This union defines additional attributes for different types of I3C commands.
     */
    union {
        /**
         * @brief Address Assignment Command High Part
         *
         * No additional data for address assignment commands.
         */
        struct {
            uint32_t reserved0 : 32; ///< Reserved bits.
        } addr;

        /**
         * @brief Immediate Command High Part
         *
         * Provides up to four bytes of data for the immediate command.
         */
        struct {
            uint32_t byte1 : 8; ///< First byte of data.
            uint32_t byte2 : 8; ///< Second byte of data.
            uint32_t byte3 : 8; ///< Third byte of data.
            uint32_t byte4 : 8; ///< Fourth byte of data.
        } immediate;

        /**
         * @brief Regular Transfer Command High Part
         *
         * Defines the data length for regular transfer commands.
         */
        struct {
            uint32_t reserved0 : 16; ///< Reserved bits.
            uint32_t dl        : 16; ///< Data length (number of bytes to transfer).
        } regular;

        /**
         * @brief Raw Value Access
         *
         * Provides direct access to the 32-bit value of the high part of the command.
         */
        uint32_t val; ///< Raw 32-bit value of the high part of the command.
    } cmd_h; ///< High part of the command.
} i3c_master_ll_command_descriptor_t;

/**
 * @brief I3C Master Error State Enumeration
 */
typedef enum {
    I3C_MASTER_LL_NO_ERROR = 0,                       ///< Indicates that the I3C master encountered no errors.
    I3C_MASTER_LL_READ_LENGTH_MISMATCH = 3,           ///< The length of data read from the slave device does not match the expected or requested length.
    I3C_MASTER_LL_BROADCAST_ADDRESS_NACK_ERROR = 4,          ///< Broadcast Address NACK Error.
    I3C_MASTER_LL_ADDRESS_NACK_OR_DYNAMIC_ADDRESS_NACK = 5,  ///< Address NACK or Dynamic Address NACK.
    I3C_MASTER_LL_BUFFER_RX_OVERFLOW_TX_UNDERFLOW = 6,       ///< Buffer RX Overflow or TX Underflow.
    I3C_MASTER_LL_I2C_SLAVE_WRITE_DATA_NACK_ERROR = 9,       ///< I2C Slave Write Data NACK Error.
} i3c_master_ll_error_state_t;

/**
 * @brief I3C master response data
 *
 * This union represents the response data structure used by the I3C master.
 * It includes fields for data length, transaction ID, and error status.
 */
typedef union {
    struct {
        uint32_t dl         : 16; ///< Data Length. For Write Transfer: Remaining data length (in bytes).
        ///< For Read Transfer: Received data length (in bytes).
        ///< For Address Assignment: Remaining Devices count.
        uint32_t reserved16 : 8;
        uint32_t tid        : 4;  ///< Identification tag for the command. This value shall match one of commands sent on the bus.
        uint32_t err_sts    : 4;  ///< Error state: A 4-bit field indicating the error state of the transaction. See `i3c_master_ll_error_state_t`
    };
    uint32_t val;
} i3c_master_ll_response_descriptor_t;

/**
 * @brief I3C master operating mode
 *
 * This enumeration defines the operating modes for an I3C master.
 * It can either operate in the I3C protocol mode or be backward-compatible with I2C devices.
 */
typedef enum {
    I3C_MASTER_LL_MODE_I3C = 0, ///< I3C works under I3C mode
    I3C_MASTER_LL_MODE_I2C = 1, ///< I3C works under I2C mode
} i3c_master_ll_mode_t;

/**
 * @brief I2C under I3C master speed mode
 *
 * This enumeration defines the speed modes for an I3C master.
 * It can either operate in the I3C protocol mode or be backward-compatible with I2C devices.
 */
typedef enum {
    I3C_MASTER_LL_I2C_FAST_MODE = 0, ///< I3C works under I2C fast mode
    I3C_MASTER_LL_I2C_FAST_MODE_PLUS = 1, ///< I3C works under I2C fast mode plus
} i3c_master_ll_i2c_speed_mode_t;

/**
 * @brief I3C Device address descriptor
 *
 * This structure represents a single entry in the I3C master address table.
 * It is used to store and manage the static and dynamic addresses of devices
 * on the I3C bus in different modes.
 */
typedef union {
    /**
     * @brief I3C device with static address
     *
     * Use SETDASA (Set Dynamic Address from Static Address) command to assign a dynamic address to a device based on its static address.
     */
    struct {
        uint32_t static_addr  : 7;  ///< Static Address of the I3C Target.
        uint32_t reserved7    : 9;  ///< Reserved bits.
        uint32_t dynamic_addr : 7;  ///< For SETDASA command, it is the Dynamic Address to be assigned to the I3C device with Static Address.
        ///< For other transfer, it is the Dynamic Address used as the targets’ address.
        uint32_t reserved24   : 6;  ///< Reserved bits.
        uint32_t dnrc         : 2;  ///< Device NACK Retry Counter. It decides the number of retry when current transfer nacked.
        uint32_t mode         : 1;  ///< Mode indicator, must be I3C mode (0). See `i3c_master_ll_mode_t`.
    } i3c_static;

    /**
     * @brief I3C device with dynamic address
     *
     * Use ENTDAA (Enter Dynamic Address Assignment) command is used to dynamically assign addresses to devices without requiring a static address.
     */
    struct {
        uint32_t reserved0    : 16; ///< Reserved bits.
        uint32_t dynamic_addr : 7;  ///< For ENTDAA command, it is the Dynamic Address to be assigned to the I3C device without Static Address.
        ///< For other transfer, it is the Dynamic Address used as the targets’ address.
        uint32_t par          : 1;  ///< Parity Bit of 7-bit Dynamic Address.
        uint32_t reserved24   : 5;  ///< Reserved bits.
        uint32_t dnrc         : 2;  ///< Device NACK Retry Counter. It decides the number of retry when current transfer nacked.
        uint32_t mode         : 1;  ///< Mode indicator, must be I3C mode (0). See `i3c_master_ll_mode_t`.
    } dynamic;

    /**
     * @brief I2C devices with static address
     *
     * This mode is used to represent devices operating in I2C mode.
     */
    struct {
        uint32_t static_addr : 7;   ///< Static address of the I2C device (7-bit).
        uint32_t reserved7   : 22;  ///< Reserved bits.
        uint32_t dnrc        : 2;   ///< Device NACK Retry Counter. It decides the number of retry when the current transfer is nacked.
        uint32_t mode        : 1;   ///< Mode indicator, must be I2C mode (1). See `i3c_master_ll_mode_t`.
    } i2c_static;

    /**
     * @brief Raw Value
     *
     * This provides direct access to the raw 32-bit value of the entry,
     * allowing for low-level manipulation or initialization.
     */
    uint32_t val; ///< Raw 32-bit value of the address table entry.
} i3c_master_ll_device_address_descriptor_t;

/**
 * @brief I3C Device Characteristic Descriptor
 *
 * Holds the basic information read from the Device Characteristic Table (DCT),
 * including PID, BCR, DCR, and the dynamic address, used to identify and manage
 * I3C target devices.
 */
typedef struct {
    uint64_t pid;           ///< Provisional ID, 48-bit PID (stored in 64-bit here)
    uint8_t  bcr;           ///< Bus Characteristics Register
    uint8_t  dcr;           ///< Device Characteristics Register (device class/type)
    uint8_t  dynamic_addr;  ///< 7-bit dynamic address assigned via DATA/SETDASA
} i3c_master_ll_device_char_descriptor_t;

/**
 * @brief IBI response status
 *
 * Indicates the master's response to a target's In-Band Interrupt (IBI/SIR) request.
 */
typedef enum {
    I3C_MASTER_LL_IBI_ACK = 0x0,   ///< Master accepts the IBI (ACK)
    I3C_MASTER_LL_IBI_NACK = 0x1,  ///< Master rejects the IBI (NACK)
} i3c_master_ll_ibi_status_t;

/**
 * @brief IBI Status Descriptor
 *
 * Summarizes the key information for a single IBI event, including the payload
 * length, a source identifier, and the master's response status.
 */
typedef struct {
    size_t ibi_data_length;                  ///< IBI payload length in bytes
    size_t ibi_identifier;                   ///< IBI source identifier (reported by HW to identify the requester)
    i3c_master_ll_ibi_status_t ibi_sts;      ///< IBI response status, see `i3c_master_ll_ibi_status_t`
} i3c_master_ll_ibi_status_descriptor_t;

