espressif/esp-idf/components/esp_hal_i3c/esp32p4/include/hal/i3c_master_ll.h
typedef enum {
    I3C_MASTER_LL_FIFO_WM_LENGTH_2 = 0x0,
    I3C_MASTER_LL_FIFO_WM_LENGTH_4 = 0x1,
    I3C_MASTER_LL_FIFO_WM_LENGTH_8 = 0x2,
    I3C_MASTER_LL_FIFO_WM_LENGTH_16 = 0x3,
    I3C_MASTER_LL_FIFO_WM_LENGTH_31 = 0x4,
} i3c_master_ll_fifo_wm_t;

/**
 * @brief Set the clock source for the I3C master
 *
 * @param hw I3C master hardware instance
 * @param src_clk Clock source, (1) for PLL_F160M, (0) for XTAL
 */
static inline void i3c_master_ll_set_source_clk(i3c_mst_dev_t *hw, i3c_master_clock_source_t src_clk)
{
    (void)hw; // Suppress unused parameter warning
    switch (src_clk) {
    case I3C_MASTER_CLK_SRC_XTAL:
        HP_SYS_CLKRST.peri_clk_ctrl119.reg_i3c_mst_clk_src_sel = 0;
        break;
    case I3C_MASTER_CLK_SRC_PLL_F160M:
        HP_SYS_CLKRST.peri_clk_ctrl119.reg_i3c_mst_clk_src_sel = 1;
        break;
    case I3C_MASTER_CLK_SRC_PLL_F120M:
        HP_SYS_CLKRST.peri_clk_ctrl119.reg_i3c_mst_clk_src_sel = 2;
        break;
    default:
        HAL_ASSERT(false);
    }
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define i3c_master_ll_set_source_clk(...) do {(void)__DECLARE_RCC_ATOMIC_ENV; i3c_master_ll_set_source_clk(__VA_ARGS__);} while(0)

/**
 * @brief Set the device address table for the I3C master
 *
 * @param hw I3C master hardware instance
 * @param addr_table Device address table
 * @param device_number Number of devices
 */
__attribute__((always_inline))
static inline void i3c_master_ll_set_device_address_table(i3c_mst_dev_t *hw, i3c_master_ll_device_address_descriptor_t *addr_table, size_t device_number)
{
    for (int i = 0; i < device_number; i++) {
        I3C_MST_MEM.dev_addr_table[i].val = addr_table[i].val;
    }
}

/**
 * @brief Enable or disable the bus clock for the I3C master
 *
 * @param hw I3C master hardware instance
 * @param enable Whether to enable the bus clock
 */
static inline void i3c_master_ll_enable_bus_clock(i3c_mst_dev_t *hw, bool enable)
{
    (void)hw; // Suppress unused parameter warning
    HP_SYS_CLKRST.soc_clk_ctrl2.reg_i3c_mst_apb_clk_en = enable;
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define i3c_master_ll_enable_bus_clock(...) do {(void)__DECLARE_RCC_ATOMIC_ENV; i3c_master_ll_enable_bus_clock(__VA_ARGS__);} while(0)

/**
 * @brief Enable or disable the clock for the I3C master
 *
 * @param hw I3C master hardware instance
 * @param enable Whether to enable the clock
 */
static inline void i3c_master_ll_enable_controller_clock(i3c_mst_dev_t *hw, bool enable)
{
    (void)hw; // Suppress unused parameter warning
    HP_SYS_CLKRST.peri_clk_ctrl119.reg_i3c_mst_clk_en = enable;
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define i3c_master_ll_enable_controller_clock(...) do {(void)__DECLARE_RCC_ATOMIC_ENV; i3c_master_ll_enable_controller_clock(__VA_ARGS__);} while(0)

/**
 * @brief Reset the I3C master registers
 *
 * @param hw I3C master hardware instance
 */
static inline void i3c_master_ll_reset_register(i3c_mst_dev_t *hw)
{
    (void)hw; // Suppress unused parameter warning
    HP_SYS_CLKRST.hp_rst_en1.reg_rst_en_i3cmst = 1;
    HP_SYS_CLKRST.hp_rst_en1.reg_rst_en_i3cmst = 0;
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define i3c_master_ll_reset_register(...) do {(void)__DECLARE_RCC_ATOMIC_ENV; i3c_master_ll_reset_register(__VA_ARGS__);} while(0)

/**
 * @brief Set the command table for the I3C master
 *
 * @param hw I3C master hardware instance
 * @param command_buf Command buffer
 * @param command_num Number of commands
 */
__attribute__((always_inline))
static inline void i3c_master_ll_set_command(i3c_mst_dev_t *hw, i3c_master_ll_command_descriptor_t *command_buf, size_t command_num)
{
    for (int i = 0; i < command_num; i++) {
        I3C_MST_MEM.command_buf_port.reg_command = command_buf[i].cmd_l.val;
        I3C_MST_MEM.command_buf_port.reg_command = command_buf[i].cmd_h.val;
    }
}

/**
 * @brief Start a transaction on the I3C master
 *
 * @param hw I3C master hardware instance
 */
__attribute__((always_inline))
static inline void i3c_master_ll_start_transaction(i3c_mst_dev_t *hw)
{
    hw->device_ctrl.reg_trans_start = 1;
    hw->device_ctrl.reg_trans_start = 0;
}

/**
 * @brief Inject the broadcast address in private transfer and legacy I2C transfer
 *
 * @note In-Band Interrupts driven from slaves may not win address arbitration if the broadcast address is not injected.
 *
 * @param hw I3C master hardware instance
 * @param enable Whether to enable or disable the broadcast address injection
 */
static inline void i3c_master_ll_inject_broadcast_address_head(i3c_mst_dev_t *hw, bool enable)
{
    hw->device_ctrl.reg_ba_include = enable ? 1 : 0;
}

/**
 * @brief Set the open-drain timing for I3C master with duty cycle
 *
 * @param hw I3C master hardware instance
 * @param clock_source_freq Clock source frequency
 * @param scl_freq SCL frequency
 * @param duty_cycle_num Duty cycle numerator, represents the numerator of the duty cycle ratio (duty_cycle = duty_cycle_num / duty_cycle_denom)
 * @param duty_cycle_denom Duty cycle denominator, represents the denominator of the duty cycle ratio (duty_cycle = duty_cycle_num / duty_cycle_denom)
 */
static inline void i3c_master_ll_set_i3c_open_drain_timing(i3c_mst_dev_t *hw, uint32_t clock_source_freq, uint32_t scl_freq, uint32_t duty_cycle_num, uint32_t duty_cycle_denom)
{
    HAL_ASSERT(duty_cycle_denom != 0);
    uint64_t target_period = (uint64_t)clock_source_freq / (uint64_t)scl_freq;
    uint32_t high_period = (uint32_t)((target_period * (uint64_t)duty_cycle_num) / (uint64_t)duty_cycle_denom);
    uint32_t low_period = (uint32_t)target_period - high_period;

    // Ensure minimum period values
    if (high_period < 1) {
        high_period = 1;
    }
    if (low_period < 1) {
        low_period = 1;
    }

    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i3c_mst_od_time, reg_i3c_mst_od_high_period, (high_period - 1));
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i3c_mst_od_time, reg_i3c_mst_od_low_period, (low_period - 1));
}

/**
 * @brief Set the fast mode timing for I2C master
 *
 * @param hw I3C master hardware instance
 * @param clock_source_freq Clock source frequency
 * @param scl_freq SCL frequency
 */
__attribute__((always_inline))
static inline void i3c_master_ll_set_i2c_fast_mode_timing(i3c_mst_dev_t *hw, uint32_t clock_source_freq, uint32_t scl_freq)
{
    uint32_t period_cnt = clock_source_freq / scl_freq / 2;
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i2c_fm_time, reg_i2c_fm_high_period, (period_cnt - 1));
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i2c_fm_time, reg_i2c_fm_low_period, (period_cnt - 1));
}

/**
 * @brief Set the fast mode+ timing for I2C master
 *
 * @param hw I3C master hardware instance
 * @param clock_source_freq Clock source frequency
 * @param scl_freq SCL frequency
 */
__attribute__((always_inline))
static inline void i3c_master_ll_set_i2c_fast_mode_plus_timing(i3c_mst_dev_t *hw, uint32_t clock_source_freq, uint32_t scl_freq)
{
    uint32_t period_cnt = clock_source_freq / scl_freq / 2;
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i2c_fmp_time, reg_i2c_fmp_high_period, (period_cnt - 1));
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i2c_fmp_time, reg_i2c_fmp_low_period, (period_cnt - 1));
}

/**
* @brief Set the push-pull timing for I3C master with duty cycle
*
* @param hw I3C master hardware instance
* @param clock_source_freq Clock source frequency
* @param scl_freq SCL frequency
* @param duty_cycle_num Duty cycle numerator, represents the numerator of the duty cycle ratio (duty_cycle = duty_cycle_num / duty_cycle_denom)
* @param duty_cycle_denom Duty cycle denominator, represents the denominator of the duty cycle ratio (duty_cycle = duty_cycle_num / duty_cycle_denom)
*/
static inline void i3c_master_ll_set_i3c_push_pull_timing(i3c_mst_dev_t *hw, uint32_t clock_source_freq, uint32_t scl_freq, uint32_t duty_cycle_num, uint32_t duty_cycle_denom)
{
    HAL_ASSERT(duty_cycle_denom != 0);
    uint64_t target_period = (uint64_t)clock_source_freq / (uint64_t)scl_freq;
    uint32_t high_period = (uint32_t)((target_period * (uint64_t)duty_cycle_num) / (uint64_t)duty_cycle_denom);
    uint32_t low_period = (uint32_t)target_period - high_period;

    // Ensure minimum period values
    if (high_period < 1) {
        high_period = 1;
    }
    if (low_period < 1) {
        low_period = 1;
    }

