espressif/esp-idf/components/esp_hal_i3c/esp32p4/include/hal/i3c_master_ll.h
    // Handle fractional part to maintain accuracy

    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i3c_mst_pp_time, reg_i3c_mst_pp_high_period, (high_period - 1));
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->scl_i3c_mst_pp_time, reg_i3c_mst_pp_low_period, (low_period - 1));
}

/**
 * @brief Set the open-drain sda hold time for I3C master
 *
 * @param hw I3C master hardware instance
 * @param clock_source_freq Clock source frequency
 * @param sda_hold_time SDA hold time
 */
static inline void i3c_master_ll_set_od_sda_hold_time(i3c_mst_dev_t *hw, uint16_t sda_hold_time)
{
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->sda_hold_time, reg_sda_od_tx_hold_time, sda_hold_time);
}

/**
 * @brief Set the push-pull sda hold time for I3C master
 *
 * @param hw I3C master hardware instance
 * @param sda_hold_time SDA hold time
 */
static inline void i3c_master_ll_set_pp_sda_hold_time(i3c_mst_dev_t *hw, uint16_t sda_hold_time)
{
    HAL_FORCE_MODIFY_U32_REG_FIELD(hw->sda_hold_time, reg_sda_pp_tx_hold_time, sda_hold_time);
}

/**
 * @brief Set the restart setup time for I3C master
 *
 * @param hw I3C master hardware instance
 * @param time_ns Time in nanoseconds
 * @param clock_source_period_ns Clock source period in nanoseconds
 */
static inline void i3c_master_ll_set_restart_setup_time(i3c_mst_dev_t *hw, uint32_t time_ns, uint32_t clock_source_period_ns)
{
    hw->scl_rstart_setup.reg_scl_rstart_setup_time = (time_ns + clock_source_period_ns) / clock_source_period_ns;
}

/**
 * @brief Set the start hold time for I3C master
 *
 * @param hw I3C master hardware instance
 * @param time_ns Time in nanoseconds
 * @param clock_source_period_ns Clock source period in nanoseconds
 */
static inline void i3c_master_ll_set_start_hold_time(i3c_mst_dev_t *hw, uint32_t time_ns, uint32_t clock_source_period_ns)
{
    hw->scl_start_hold.reg_scl_start_hold_time = time_ns / clock_source_period_ns + 1;
}

/**
 * @brief Set the stop hold time for I3C master
 *
 * @param hw I3C master hardware instance
 * @param time_ns Time in nanoseconds
 * @param clock_source_period_ns Clock source period in nanoseconds
 */
static inline void i3c_master_ll_set_stop_hold_time(i3c_mst_dev_t *hw, uint32_t time_ns, uint32_t clock_source_period_ns)
{
    hw->scl_stop_hold.reg_scl_stop_hold_time = time_ns / clock_source_period_ns + 1;
}

/**
 * @brief Set the stop setup time for I3C master
 *
 * @param hw I3C master hardware instance
 * @param time_ns Time in nanoseconds
 * @param clock_source_period_ns Clock source period in nanoseconds
 */
static inline void i3c_master_ll_set_stop_setup_time(i3c_mst_dev_t *hw, uint32_t time_ns, uint32_t clock_source_period_ns)
{
    hw->scl_stop_setup.reg_scl_stop_setup_time = (time_ns + clock_source_period_ns) / clock_source_period_ns;
}

/**
 * @brief Get the data byte count from the I3C master
 *
 * @param hw I3C master hardware instance
 * @return Number of data bytes, meaning differently according to different transfer
 */
static inline uint32_t i3c_master_ll_get_data_byte_count(i3c_mst_dev_t *hw)
{
    return hw->present_state1.data_byte_cnt;
}

/**
 * @brief Read data from the RX port of the I3C master
 *
 * @param hw I3C master hardware instance
 * @param data Pointer to store the read data
 * @param length Length of data to read
 */
__attribute__((always_inline))
static inline void i3c_master_ll_read_rx_port(i3c_mst_dev_t *hw, uint8_t *data, size_t length)
{
    uint32_t data_word = 0;
    int x = 0;
    uint32_t *data_u32 = (uint32_t *)data;
    for (x = 0; x < (int)length / 4; x++) {
        data_u32[x] = I3C_MST_MEM.rx_data_port.rx_data_port;
    }
    if (length % 4) {
        data_word = I3C_MST_MEM.rx_data_port.rx_data_port;
        for (int i = 0; i < length % 4; i++) {
            data[x * 4 + i] = (data_word >> 8 * i) & 0xFF;
        }
    }
}

/**
 * @brief Write data to the TX buffer via FIFO port
 *
 * @param hw I3C master hardware instance
 * @param data Pointer to the data to write
 * @param length Length of data to write
 */
__attribute__((always_inline))
static inline void i3c_master_ll_write_tx_port(i3c_mst_dev_t *hw, const uint8_t *data, size_t length)
{
    int x = 0;
    uint32_t data_word = 0;
    const uint32_t *data_u32 = (const uint32_t *)data;
    for (x = 0; x < (int)length / 4; x++) {
        I3C_MST_MEM.tx_data_port.reg_tx_data_port = data_u32[x];
    }

    if (length % 4) {
        data_word = 0;
        for (int i = 0; i < length % 4; i++) {
            data_word |= (data[x * 4 + i] << 8 * i);
        }
        I3C_MST_MEM.tx_data_port.reg_tx_data_port = data_word;
    }
}

/**
 * @brief Get the interrupt status register of the I3C master
 *
 * @param dev I3C master hardware instance
 * @return Pointer to the interrupt status register
 */
static inline volatile void *i3c_master_ll_get_interrupt_status_reg(i3c_mst_dev_t *dev)
{
    return &dev->int_st;
}

/**
 * @brief Clear the interrupt mask for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param mask Interrupt mask to clear
 */
__attribute__((always_inline))
static inline void i3c_master_ll_clear_intr_mask(i3c_mst_dev_t *dev, uint32_t mask)
{
    dev->int_clr.val = mask;
}

/**
 * @brief Enable the interrupt mask for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param mask Interrupt mask to enable
 */
__attribute__((always_inline))
static inline void i3c_master_ll_enable_intr_mask(i3c_mst_dev_t *dev, uint32_t mask)
{
    dev->int_st_ena.val |= mask;
}

/**
 * @brief Disable the interrupt mask for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param mask Interrupt mask to disable
 */
__attribute__((always_inline))
static inline void i3c_master_ll_disable_intr_mask(i3c_mst_dev_t *dev, uint32_t mask)
{
    dev->int_st_ena.val &= (~mask);
}

/**
 * @brief Get the interrupt mask status for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param intr_status Pointer to store the interrupt status
 */
__attribute__((always_inline))
static inline void i3c_master_ll_get_intr_mask(i3c_mst_dev_t *dev, uint32_t *intr_status)
{
    *intr_status = dev->int_st.val;
}

/**
 * @brief Get the TX FIFO empty count for the I3C master
 *
 * @param dev I3C master hardware instance
 * @return TX FIFO empty count
 */
__attribute__((always_inline))
static inline uint8_t i3c_master_ll_get_tx_fifo_empty_count(i3c_mst_dev_t *dev)
{
    return dev->data_buffer_status_level.tx_data_buf_empty_cnt;
}

/**
 * @brief Get the RX FIFO full count for the I3C master
 *
 * @param dev I3C master hardware instance
 * @return RX FIFO full count
 */
__attribute__((always_inline))
static inline uint8_t i3c_master_ll_get_rx_fifo_full_count(i3c_mst_dev_t *dev)
{
    return dev->data_buffer_status_level.rx_data_buf_cnt;
}

/**
 * @brief Set the TX data FIFO watermark threshold for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param fifo_wm FIFO watermark threshold
 */
static inline void i3c_master_ll_set_tx_data_fifo_wm_threshold(i3c_mst_dev_t *dev, i3c_master_ll_fifo_wm_t fifo_wm)
{
    dev->data_buffer_thld_ctrl.reg_tx_data_buf_thld = fifo_wm;
}

/**
 * @brief Set the RX data FIFO watermark threshold for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param fifo_wm FIFO watermark threshold
 */
static inline void i3c_master_ll_set_rx_data_fifo_wm_threshold(i3c_mst_dev_t *dev, i3c_master_ll_fifo_wm_t fifo_wm)
{
    dev->data_buffer_thld_ctrl.reg_rx_data_buf_thld = fifo_wm;
}

/**
 * @brief Enable or disable TX by DMA for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param enable Whether to enable TX by DMA
 */
static inline void i3c_master_ll_enable_tx_by_dma(i3c_mst_dev_t *dev, bool enable)
{
    dev->device_ctrl.reg_dma_tx_en = enable;
}

/**
 * @brief Enable or disable RX by DMA for the I3C master
 *
 * @param dev I3C master hardware instance
 * @param enable Whether to enable RX by DMA
 */
static inline void i3c_master_ll_enable_rx_by_dma(i3c_mst_dev_t *dev, bool enable)
{
    dev->device_ctrl.reg_dma_rx_en = enable;
}

/**
 * @brief Get the response buffer value from the I3C master
 *
 * @param dev I3C master hardware instance
 * @return Response data
 */
__attribute__((always_inline))
static inline i3c_master_ll_response_descriptor_t i3c_master_ll_get_response_data(i3c_mst_dev_t *dev)
{
    return (i3c_master_ll_response_descriptor_t)(I3C_MST_MEM.response_buf_port.val);
}

/**
 * @brief Set the init value of dct_index, which points to the entry in the DCT table
 *
 * @param dev I3C master hardware instance
 * @param index DCT index value
 */
static inline void i3c_master_ll_set_init_dct_index(i3c_mst_dev_t *dev, uint32_t index)
{
    dev->device_table.reg_dct_daa_init_index = index;
}

/**
 * @brief Set the init value of dat_index, which points to the entry in the DAT table
 *
 * @param dev I3C master hardware instance
 * @param index DAT index value
 */
static inline void i3c_master_ll_set_init_dat_index(i3c_mst_dev_t *dev, uint32_t index)
{
    dev->device_table.reg_dat_daa_init_index = index;
}

/**
 * @brief Get the current DCT index
 *
 * @param dev I3C master hardware instance
 * @return Current DCT index
 */
static inline uint32_t i3c_master_ll_get_current_dct_index(i3c_mst_dev_t *dev)
{
    return dev->device_table.present_dct_index;
}

/**
 * @brief Get the current DAT index
 *
 * @param dev I3C master hardware instance
 * @return Current DAT index
 */
static inline uint32_t i3c_master_ll_get_current_dat_index(i3c_mst_dev_t *dev)
{
    return dev->device_table.present_dat_index;
}

/**
 * @brief Read a Device Characteristic Table (DCT) entry
 *
 * Fetches one entry from the hardware DCT and fills the provided
 * `i3c_master_ll_device_char_descriptor_t` with PID, BCR, DCR, and
 * dynamic address information.
 *
 * @param dev I3C master hardware instance
 * @param dev_char_table Output descriptor to receive the parsed device information
 * @param device_number Index of the device entry in the hardware DCT
 */
static inline void i3c_master_ll_get_dev_char_table(i3c_mst_dev_t *dev, i3c_master_ll_device_char_descriptor_t *dev_char_table, size_t device_number)
{
    uint32_t pid_0_15 = I3C_MST_MEM.dev_char_table[device_number].loc1 & 0xFFFF;
    uint32_t pid_16_48 = I3C_MST_MEM.dev_char_table[device_number].loc0 & 0xFFFF;
    dev_char_table->pid = ((pid_0_15) | (pid_16_48 << 16));
    dev_char_table->bcr = I3C_MST_MEM.dev_char_table[device_number].loc2 & 0xFF;
    dev_char_table->dcr = (I3C_MST_MEM.dev_char_table[device_number].loc2 >> 8) & 0xFF;
    dev_char_table->dynamic_addr = I3C_MST_MEM.dev_char_table[device_number].loc3 & 0xFF;
}

/**
 * @brief Configure IBI accept policy for a target
 *
 * Controls whether the master accepts or rejects IBI/SIR requests
 * from a target identified by its dynamic address.
 *
 * @param dev I3C master hardware instance
 * @param dynamic_addr 7-bit dynamic address of the target device
 * @param accept True to accept IBI requests; false to reject
 */
static inline void i3c_master_ll_set_ibi_accept(i3c_mst_dev_t *dev, uint8_t dynamic_addr, bool accept)
{
    uint8_t bit_index = ((dynamic_addr >> 5) + (dynamic_addr & 0x1F)) % 32;
    if (accept) {
        dev->ibi_sir_req_reject.reg_sir_req_reject &= ~(1UL << bit_index);
    } else {
        dev->ibi_sir_req_reject.reg_sir_req_reject |= (1UL << bit_index);
    }
}

/**
 * @brief Configure IBI payload retrieval for a target
 *
 * Enables or disables fetching IBI payload data for a specific target
 * identified by its dynamic address.
 *
 * @param dev I3C master hardware instance
 * @param dynamic_addr 7-bit dynamic address of the target device
 * @param get_payload True to fetch payload for IBI; false to ignore payload
 */
static inline void i3c_master_ll_set_ibi_payload(i3c_mst_dev_t *dev, uint8_t dynamic_addr, bool get_payload)
{
    uint8_t bit_index = ((dynamic_addr >> 5) + (dynamic_addr & 0x1F)) % 32;
    if (get_payload) {
        dev->ibi_sir_req_payload.reg_sir_req_payload |= (1UL << bit_index);
    } else {
        dev->ibi_sir_req_payload.reg_sir_req_payload &= ~(1UL << bit_index);
    }
}

/**
 * @brief Enable or disable notification on SIR rejection
 *
 * Controls whether the controller reports a notification when a
 * SIR (IBI) request is rejected by policy.
 *
 * @param dev I3C master hardware instance
 * @param notify_sir_rejected True to enable notification, false to disable
 */
static inline void i3c_master_ll_set_ibi_notify_sir_rejected(i3c_mst_dev_t *dev, bool notify_sir_rejected)
{
    dev->ibi_notify_ctrl.reg_notify_sir_rejected = notify_sir_rejected;
}

/**
 * @brief Enable or disable automatic IBI disable behavior
 *
 * When enabled, the hardware automatically disables IBI reception
 * according to its internal policy after handling an event.
 *
 * @param dev I3C master hardware instance
 * @param auto_disable_ibi True to enable auto-disable; false to keep IBI enabled
 */
static inline void i3c_master_ll_set_auto_disable_ibi(i3c_mst_dev_t *dev, bool auto_disable_ibi)
{
    dev->device_ctrl.reg_auto_dis_ibi_en = auto_disable_ibi;
}

/**
 * @brief Enable or disable restart transaction on IBI
 *
 * Controls whether the controller issues or allows a restart-based
 * transaction flow in response to an IBI event.
 *
 * @param dev I3C master hardware instance
 * @param ibi_rstart_trans_en True to enable restart flow after IBI; false to disable
 */
static inline void i3c_master_ll_set_ibi_rstart_trans_en(i3c_mst_dev_t *dev, bool ibi_rstart_trans_en)
{
    dev->device_ctrl.reg_ibi_rstart_trans_en = ibi_rstart_trans_en;
}

/**
 * @brief Read IBI status information
 *
 * Retrieves the IBI status including payload length, a source identifier,
 * and the master's ACK/NACK decision.
 *
 * @param dev I3C master hardware instance
 * @param ibi_status Output structure to receive status information
 */
__attribute__((always_inline))
static inline void i3c_master_ll_get_ibi_status(i3c_mst_dev_t *dev, i3c_master_ll_ibi_status_descriptor_t *ibi_status)
{
    size_t len = HAL_FORCE_READ_U32_REG_FIELD(I3C_MST_MEM.ibi_status_buf, data_length);
    size_t ibi_id = HAL_FORCE_READ_U32_REG_FIELD(I3C_MST_MEM.ibi_status_buf, ibi_id);
    ibi_status->ibi_data_length = len;
    ibi_status->ibi_identifier = ibi_id;
    if (I3C_MST_MEM.ibi_status_buf.ibi_sts == 0x0) {
        ibi_status->ibi_sts = I3C_MASTER_LL_IBI_ACK;
    } else {
        ibi_status->ibi_sts = I3C_MASTER_LL_IBI_NACK;
    }
}

/**
 * @brief Read IBI payload data
 *
 * Reads the specified number of bytes from the IBI data buffer into
 * the provided buffer.
 *
 * @param dev I3C master hardware instance
 * @param data Destination buffer for the IBI payload
 * @param length Number of bytes to read from the hardware buffer
 */
__attribute__((always_inline))
static inline void i3c_master_ll_get_ibi_data(i3c_mst_dev_t *dev, uint8_t *data, size_t length)
{
    HAL_ASSERT(length <= I3C_MASTER_IBI_DATA_SIZE_MAX);
    for (int i = 0; i < length; i++) {
        data[i] = I3C_MST_MEM.ibi_data_buf.ibi_data;
    }
}

/**
 * @brief reset the command buffer
 *
 * @param dev I3C master hardware instance
 */
__attribute__((always_inline))
static inline void i3c_master_ll_reset_command_buf(i3c_mst_dev_t *dev)
{
    dev->reset_ctrl.reg_cmd_buf_rst = 1;
    dev->reset_ctrl.reg_cmd_buf_rst = 0;
}

/**
 * @brief Enable or disable the I3C internal pull-up for a specific pin
 *
 * Controls the dedicated I3C pull-up resistor unit in IO MUX. This is
 * different from the generic GPIO pull-up and is intended for I3C operation.
 *
 * Note: Only IO32 and IO33 support the I3C internal pull-up on this SoC.
 *
 * @param io GPIO index, must be 32 or 33
 * @param enable true to enable the internal pull-up control; false to disable
 */
static inline void i3c_master_ll_enable_internal_pullup(int io, bool enable)
{
    HAL_ASSERT(io == 32 || io == 33);
    IO_MUX.gpio[io].i3c_rue_en = enable;
}

/**
 * @brief Set the I3C internal pull-up strength/value for a specific pin
 *
 * Programs the pull-up resistor unit value used by the I3C pin in IO MUX.
 * The exact encoding and effective resistance are hardware-defined; please
 * refer to the SoC TRM for the value-to-resistance mapping.
 *
 * Effective only if the internal pull-up is enabled via
 * i3c_master_ll_enable_internal_pullup().
 *
 * @param io GPIO index, must be 32 or 33
 * @param value Encoded pull-up value (SoC-specific)
 */
static inline void i3c_master_ll_set_internal_pullup_value(int io, i3c_master_internal_pullup_resistor_val_t value)
{
    HAL_ASSERT(io == 32 || io == 33);
    switch (value) {
    case I3C_MASTER_INTERNAL_PULLUP_RESISTOR_0_3K:
        IO_MUX.gpio[io].i3c_ru = 0;
        break;
    case I3C_MASTER_INTERNAL_PULLUP_RESISTOR_0_6K:
        IO_MUX.gpio[io].i3c_ru = 1;
        break;
    case I3C_MASTER_INTERNAL_PULLUP_RESISTOR_1_2K:
        IO_MUX.gpio[io].i3c_ru = 2;
        break;
    case I3C_MASTER_INTERNAL_PULLUP_RESISTOR_2_4K:
        IO_MUX.gpio[io].i3c_ru = 3;
        break;
    case I3C_MASTER_INTERNAL_PULLUP_RESISTOR_DISABLED:
        HAL_ASSERT(false);
        break;
    }
}

#ifdef __cplusplus
}
#endif
